var mockup = require('bat-ria-tool/mockup');

exports.response = function (path, params) {
    return mockup.list(

        [

            {
                "id":"1",
                "title":"一汽丰田全系现车限时大惠战",
                "image_default_id":"10",
                "price":"现场公布超值底价",
                "adress":"南宁市白沙大道24号(亭江路口)",
                "created_time":"1451376494",
                "updated_time":"1451376494",
                "valid_status":"0",
                "modified_by":"system",
                "start_time":"1451376494",
                "end_time":"1456848000",
                "tuan_time":"1452924000",
                "tuan_base_num":"16",
                "content":"预付199元抵1000元购车补贴",
                "intention":"皇冠,锐志,卡罗拉,花冠,威驰,普锐斯,卡罗拉双擎,RAV4,普拉多,兰德酷路泽",
                "agency":"南宁中达丰田4S店",
                "amount":"19900",
                "slogan":"精美车饰、高档行车记录仪、健康枕头，现场好礼不断",
                "page_title":"一汽丰田全系现车限时大惠战",
                "characteristics":"优先提车:当天下单可享受优先提车权，特权保证年前买车先人一步！;全城最低:承诺当日价格全城最低，如有更低价，可立即享受双倍赔付！",
                "gift":"购车补贴享不停:预付199元可得1000元活动购车补贴（不包含卡罗拉双擎）;签到礼品送送送:缴纳199元意向金，准时到店可获赠活动专属礼，价值888元金猴纳福一尊（限88尊，礼品有限，送完为止）！未缴纳199意向金，准时到店可获赠活动专属礼，U盘或手机支架一份;现场现金一把抓:订车客户可参与现金一把抓活动，一把抓获多少奖多少现金优惠（限三秒内）！;100%购车抽奖礼:一个购车订单可以抽奖一次，100%中奖！奖品有限量版卡罗拉上市纪念车模、折叠自行车、飞利浦音响、行车记录仪、保健枕、保温杯、双层保温野餐包、食用油！;特推车超级大奖:当天订购RAV4送4000元太阳膜、购皇冠送1500元苹果耳机及680元新秀丽背包！",
                "process":"免费报名:点击'免费报名';购车礼包:报名承购后即可以获得支付119元意向金抵1000元购车款大礼包;线下活动:在指定活动时间内到合作4s店参加团购活动;现场下定:现场抵消1000元",
                "share_image_id":"7",
                "coupon_content":"1、团购会现场订车可抵1000元购车款;2、babababababbababababa;3、babababababba",
                "created_by":"admin_50",
                "coupon_refund":"1、已经缴纳意向金的用户bababa;2、对于已经缴纳异想记但未但与线下活动的用户babababa",
                "status":"0",
                "tuan_tags":"签到有礼,成交有礼",
                "coupon_tags":"现场多重优惠,不订车随时退",
                "coupon_title":"199抵1000元",
                "order_count":"12",
                "image_url":"/uploadFiles/ce54c9541615d6cfe8221d9205d55894.jpg"
            },
            {
                "id":"2",
                "title":"东风雪铁龙封年抢购会 现金大补Tie！",
                "image_default_id":"80",
                "price":"现场公布超值低价",
                "adress":"洪山区东湖高新开发区大学园路7号",
                "created_time":"1451376494",
                "updated_time":"1451376494",
                "valid_status":"0",
                "modified_by":"system",
                "start_time":"1451376494",
                "end_time":"1456848000",
                "tuan_time":"1453409200",
                "tuan_base_num":"15",
                "content":"预付199元诚意金抵1000元购车款",
                "intention":"世嘉,C4世嘉,C4L,爱丽舍C3-XR,C5",
                "agency":"湖北中发雪铁龙4S店",
                "amount":"1",
                "slogan":"青花瓷器、高档行车记录仪、健康枕头，现场好礼不断！",
                "page_title":"东风雪铁龙封年抢购会",
                "characteristics":"优先提车:当天下单可享受优先提车权，特权保证年前买车先人一步！;全城最低:承诺当日价格全城最低，如有更低价，可立即享受双倍赔付！",
                "gift":"购车补贴享不停:预付199元可得1000元活动购车补贴;签到礼品送送送:抢购会现场签到，就有精美签到礼等着您！;现场订车抽大奖:现场订车，即可参与叭叭买车订车抽奖！",
                "process":"免费报名参与流程：;点击“免费报名”，填写意向车型及电话号码，即可参与东风雪铁龙现车限时抢购会！;购车补贴预约流程：;1、点击“支付199元诚意金”，填写意向后支付199元诚意金进行线上预约。;2、收到支付成功短信后即获得活动参与资格，也可在叭叭买车微信公众号“我的叭叭-我的团购”中可查看补贴凭证。;3、在指定活动时间到达活动经销店参与线下抢购会！;4、在活动现场享受优惠并下订,下订后诚意金直接转为定金。;5、由叭叭买车工作人员确认购车订单后获得我们送出的购车补贴和订车礼品。",
                "share_image_id":"7",
                "coupon_content":"1、团购会现场订车可抵1000元购车款;2、babababababbababababa;3、babababababba",
                "created_by":"admin_25",
                "coupon_refund":"1、已经缴纳意向金的用户bababa;2、对于已经缴纳异想记但未但与线下活动的用户babababa",
                "status":"0",
                "tuan_tags":"签到有礼,成交有礼",
                "coupon_tags":"现场多重优惠,不订车随时退",
                "coupon_title":"199抵1000元",
                "order_count":"3",
                "image_url":"/uploadFiles/20160113_1452684555824064.jpg"
            }
        ]

    );

};